/* Задача 4: Напишите программу, которая принимает на вход три числа
и выдаёт максимальное из этих чисел.*/
Console.Write("Введите чило №1:");
int numberA = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите чило №2:");
int numberB = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите чило №3:");
int numberB = Convert.ToInt32(Console.ReadLine());
if (numberA > numberB)
{
Console.WriteLine($"Первое число {numberA} большее ");
}
if (numberA < numberB)
{
    Console.WriteLine($"Второе число {numberB} большее ");
